Revit 2026 API

# ApplicationOpenSharedParameterFile Method

---

Enables access to shared parameter groups and definitions that are maintained on disk.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DefinitionFile OpenSharedParameterFile()
```
```vb
Public Function OpenSharedParameterFile As DefinitionFile
```
```cpp
public:
DefinitionFile^ OpenSharedParameterFile()
```
```fsharp
member OpenSharedParameterFile : unit -> DefinitionFile
```

#### Return Value

DefinitionFileAn object that represents a shared parameters file that exists on disk. Returns  if the file does not exist.

This function is used to return an object that represents a Revit shared parameters file Revit can use only one shared parameters file at one time. The filename for the shared parameters file can be set in the Application.SharedParametersFilename property.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace